Tekla.Structures.Model.CylindricalSurface.lateralBoundary1
The first lateral boundary.

Tekla.Structures.Model.CylindricalSurface.lateralBoundary2
The second lateral boundary.

Tekla.Structures.Model.CylindricalSurface.InwardCurved
Gets the direction of the curve - true if the curve is oriented towards the intersection line, false otherwise.

Tekla.Structures.Model.CylindricalSurface.IntersectionLine
Gets intersection line.

Tekla.Structures.Model.CylindricalSurface.EndFaceNormal1
Gets the first end face normal.

Tekla.Structures.Model.CylindricalSurface.EndFaceNormal2
Gets the second end face normal.

Tekla.Structures.Model.CylindricalSurface.SideBoundary1
Gets or sets the first side boundary.

Tekla.Structures.Model.CylindricalSurface.SideBoundary2
Gets or sets the second side boundary.

Tekla.Structures.Model.CylindricalSurface.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Instantiates a cylindrical surface with given parameters.
endFaceNormal1: The first end face normal.
endFaceNormal2: The second end face normal.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.
Throws System.ArgumentNullException: Throws exception if one of the arguments has null value.

Tekla.Structures.Model.CylindricalSurface.SetLateralBoundaries(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Sets lateral boundaries using side boundaries.
sideBoundary1: The first side boundary.
sideBoundary2: The second side boundary.

Tekla.Structures.Model.CylindricalSurface.CreateCollinearSegment(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Returns a line segment in the same direction as originalSide.
originalSide: Side to get direction from.
newSide: Side to be checked.
Returns: Returns a line segment in the same direction as originalSide.

Tekla.Structures.Model.CylindricalSurface.ModifySideBoundary(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment)
Returns new line segment as a new side boundary after validations.
newSideBoundary: New side segment to set.
sideToUpdate: Old side segment to change.
Returns: Returns new line segment as a new side boundary.
Throws System.ArgumentException: Throws exception if distance between new side points is too small.

Tekla.Structures.Model.CylindricalSurface.CalculateRadius
Calculates radius of cylindrical surface.
Returns: The cylindrical surface radius.
Throws System.InvalidOperationException: Thrown, when the data do not define proper surface.

Tekla.Structures.Model.CylindricalSurface.CalculateIntersectionLine(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Calculates intersection line between two plates
sideBoundary1: First side boundary of cylindrical surface.
sideBoundary2: Second side boundary of cylindrical surface.
endFaceNormal1: First end face normal of the first plate.
endFaceNormal2: Second end face normal of the second plate.
Returns: The intersection line.

Tekla.Structures.Model.CylindricalSurface.IsInwardCurved(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Calculate Inward/Outward curve flag.
face1Point: First face point.
face2Point: Second face point.
endFaceNormal1: First end face normal.
endFaceNormal2: Second end face normal.
Returns: True if the curve is oriented towards the intersection line, false otherwise.